[
  {
    "id": 1,
    "author": "Cecilia Saiden Davis",
    "date": "Jan 22, 2025",
    "transaction": "Bought a townhouse in Central City East, Los Angeles, CA (2024)",
    "rating": 5,
    "text": "Sebastian did an amazing job helping me purchase my home. I stayed in the exact area I wanted and he worked with me to keep the monthly payment in budget. He even introduced me to my new favorite breakfast spot. Great guy and even better agent."
  },
  {
    "id": 2,
    "author": "Celina Carey",
    "date": "Jan 20, 2025",
    "transaction": "Represented us as both seller and buyer in 2024",
    "rating": 5,
    "text": "Sebastian met every need at every step. When an issue came up during our purchase he quickly negotiated new terms and kept communication clear. We’ll absolutely work with him again."
  },
  {
    "id": 3,
    "author": "lifechen18",
    "date": "Mar 12, 2024",
    "transaction": "Home tour in Northeast Anchorage, AK",
    "rating": 5,
    "text": "Very knowledgeable and never pushy. Sebastian answered every question, kept us aware of the market, and made the entire first-time experience enjoyable."
  },
  {
    "id": 4,
    "author": "mogueljulio",
    "date": "Mar 9, 2024",
    "transaction": "Bought a single-family home in Topanga, CA (2023)",
    "rating": 5,
    "text": "He was invested in making sure we landed the right property and stayed responsive throughout the entire process. Couldn’t have asked for a better advocate."
  },
  {
    "id": 5,
    "author": "fyt6d8k8pd",
    "date": "Mar 6, 2024",
    "transaction": "Previewed homes in Santa Monica, CA 90404",
    "rating": 5,
    "text": "Sebastian showed us a ton of homes and built a step-by-step plan so we’re ready when it’s time to buy. He’ll be our go-to agent when we make the move."
  },
  {
    "id": 6,
    "author": "aliensfrommarz",
    "date": "Mar 6, 2024",
    "transaction": "Home search in 2024",
    "rating": 5,
    "text": "My fiancé and I found our dream home with Sebastian. He knows the market, stays on top of trends, and guides you from start to finish. Truly the best."
  },
  {
    "id": 7,
    "author": "y9xxmdddpy",
    "date": "Mar 6, 2024",
    "transaction": "Guided tour in Hayden, AL",
    "rating": 5,
    "text": "He was professional, responsive, and made our search easy. Every question had a fast answer and he knew the neighborhoods inside out."
  },
  {
    "id": 8,
    "author": "Alejandra Zugasti",
    "date": "Mar 6, 2024",
    "transaction": "Bought a condo in Chino Hills, CA (2024)",
    "rating": 5,
    "text": "Sebastian listened, sourced several options, and led me to the perfect home. He stayed timely, responsive, and detail-oriented through escrow."
  },
  {
    "id": 9,
    "author": "zuser20161017101804419",
    "date": "Nov 29, 2023",
    "transaction": "Bought a single-family home in Hesperia, CA (2023)",
    "rating": 5,
    "text": "Outstanding service from start to finish. He coordinated with every party to keep us on track and was relentlessly professional."
  },
  {
    "id": 10,
    "author": "ryanbuesa",
    "date": "Sep 12, 2023",
    "transaction": "Home tour in Glendora, CA (2023)",
    "rating": 5,
    "text": "There’s a huge difference between a good agent and a great one. Sebastian hits every mark and now I’m seriously considering buying thanks to him."
  },
  {
    "id": 11,
    "author": "akazi574",
    "date": "Sep 12, 2023",
    "transaction": "Previewed homes in Chino Hills, CA 91709",
    "rating": 5,
    "text": "Sebastian was professional, educational, and patient. He walked me through the buying process and I’m excited to keep working with him."
  }
]

